[
  {
    "name": "Cayuse LLC",
    "url": "https://cayuse.com/",
    "title": "Software Engineer",
    "dates": "7/2017 - present",
    "experienceContents": {
      "description": [
        "Contributed to development of Spring based Java projects",
        "Managed AWS environments for new microservices",
        "Developed functional tests that became the blueprint for all web-driver based testing at Cayuse.",
        "Created first Gatling.io based performance tests at Cayuse.",
        "Mentored other developers in front end development within an MVC framework",
        "Established coding standards for node based development",
        "Practiced TDD principles in both Node and Java projects",
        "Followed Agile principles"
      ],
      "projects": [
        {
          "name": "Worked on the team that maintained Cayuse's flagship 424 project ",
          "techsUsed": "JavaServer Pages, Java, JUnit, Mockito, Gatling.io, Nightwatch.js, Javascript, jQuery, Hibernate, PostgreSQL, subversion, git, Jira, html, CSS"
        },
        {
          "name": "Worked on Spring Boot based microservices that interfaced with 424 and Grants.gov services.",
          "techsUsed": "Spring Boot, Java, JUnit, Mockito, Gatling.io, Elasticsearch, Amazon SNS, Amazon SQS, Terraform, Bitbucket Pipelines, git, Jira"
        },
        {
          "name": "Lead overhaul of front end for the 424 product ",
          "techsUsed": "JavaServer Pages, Java, Javascript, jQuery, subversion, Jira, html, CSS"
        },
        {
          "name": "Lead implementation of a saml based single sign on solution for Cayuse's legacy suite of products.",
          "techsUsed": "Node.js, Serverless, git, bash, Jira, html, css, Mocha, Chai, Sinon"
        },
        {
          "name": "Lead implementation of a saml based single sign on solution for Cayuse's administrative suite of products.",
          "techsUsed": "Node.js, Serverless, git, bash, Jira, html, css, Mocha, Chai, Sinon"
        },
        {
          "name": "Lead front end development for the team that maintained Cayuse's administrative console ",
          "techsUsed": "Javascript, Backbone, Marionette, git, bash, Jira, html, SCSS"
        },
        {
          "name": "Worked with my development team on several of Cayuse's Spring framework based micro services",
          "techsUsed": "Spring, Java, JUnit, Mockito, groovy, Hibernate, PostgreSQL, Swagger, git, bash, Jira"
        }
      ]
    }
  },
  {
    "name": "Wirestorm Technologies",
    "url": "https://www.wirestorm.us/",
    "title": "Full Stack Javascript Developer",
    "dates": "4/2015 - 7/2017",
    "experienceContents": {
      "description": [
        "Followed Agile principles",
        "Created web and hybrid apps using modern frameworks",
        "Used the MVC architectural pattern with appropriate frameworks",
        "Assisted with work on servers when such work was done in house"
      ],
      "projects": [
        {
          "name": "Lead front end development on a project that connects people seeking loans to verified lenders.",
          "techsUsed": "Javascript, React, Redux, git, bash, Jira, html, SCSS, Jest"
        },
        {
          "name": "Worked on a hybrid mobile app to manage a user's schedule and conduct VOIP calls",
          "techsUsed": "Javascript, Ionic2, Angular2, Redux, Twilio, git, bash, Jira, html, SCSS"
        },
        {
          "name": "Worked on an app that stored payment information and connected it to user accounts",
          "techsUsed": "Javascript, React-Native, Redux, git, bash, Asana, html, SCSS"
        },
        {
          "name": "Worked on the server and front end for an app that scheduled appointments and tracked capacity for each type of appointment",
          "techsUsed": "Javascript, Node.js, Swagger, PostgreSQL, React, Flux, git, bash, Asana, html, SCSS"
        },
        {
          "name": "Lead development on an app that included a calendar, a messenger, and notifications",
          "techsUsed": "Javascript, AngularJS, Ionic, Node.js, Socket.io, MongoDB, git, bash, Asana, html, SCSS"
        }
      ]
    }
  }
]
